УТ_для_edt.РасширениеСмарт/src/Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтавкиНДС</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>БезНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НДС10</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НДС18</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НДС0</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НДС20</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/CommonModules/УчетНДСПереопределяемый/Module.bsl
#Область ПеренесеноСДоработками

&ИзменениеИКонтроль("НомерСчетаФактурыНаПечать")
Функция смарт_НомерСчетаФактурыНаПечать(Номер, УдалитьПользовательскийПрефикс, ОбособленноеПодразделение, ЦифровойИндексОбособленногоПодразделения)
	
	#Удаление
	НомерНаПечать = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Номер, Ложь, УдалитьПользовательскийПрефикс);
	#КонецУдаления
	
	#Вставка
	//++ смарт закомментировано, чтобы вырезался префикс базы из номера с/ф
	//НомерНаПечать = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Номер, Ложь, УдалитьПользовательскийПрефикс);
	НомерНаПечать = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Номер, Истина, УдалитьПользовательскийПрефикс);
	//-- смарт
	#КонецВставки
	
	Если ОбособленноеПодразделение И ЗначениеЗаполнено(ЦифровойИндексОбособленногоПодразделения) Тогда
		НомерНаПечать = НомерНаПечать + "/" + ЦифровойИндексОбособленногоПодразделения;
	КонецЕсли;
	
	Возврат НомерНаПечать;
	
КонецФункции

&ИзменениеИКонтроль("ПолучитьСтавкуНДС")
Функция смарт_ПолучитьСтавкуНДС(СтавкаНДС, ПрименяютсяСтавки4и2)

	Если СтавкаНДС = Перечисления.СтавкиНДС.НДС20 ИЛИ СтавкаНДС = Перечисления.СтавкиНДС.НДС20_120 Тогда
		Возврат 20;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС10 ИЛИ СтавкаНДС = Перечисления.СтавкиНДС.НДС10_110 Тогда
		Ставка = ?(ПрименяютсяСтавки4и2, 2, 10);
		Возврат Ставка;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС18 ИЛИ СтавкаНДС = Перечисления.СтавкиНДС.НДС18_118 Тогда
		Ставка = ?(ПрименяютсяСтавки4и2, 4, 18);
		Возврат Ставка;
	#Вставка
	//++ #1744 смарт: Шляпников 19.12.2024 / УТ. Добавить ставки НДС 5% и 7%
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС5 ИЛИ СтавкаНДС = Перечисления.СтавкиНДС.НДС5_105 Тогда
		Возврат 5;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС7 ИЛИ СтавкаНДС = Перечисления.СтавкиНДС.НДС7_107 Тогда
		Возврат 7;
	//-- #1744 смарт: Шляпников 19.12.2024
	//++ #4804 смарт: Тимофеева 12.11.2025 / Добавить ставку НДС22
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС22 ИЛИ СтавкаНДС = Перечисления.СтавкиНДС.НДС22_122 Тогда
		Возврат 22;
	//-- #4804 смарт: Тимофеева 12.11.2025
	#КонецВставки
	КонецЕсли;

	Возврат 0;

КонецФункции

#КонецОбласти
